app/Controllers/DetailedQrCodeController.php

SELECT *
FROM `detailed_qr_codes`
WHERE `user_id` = '8'
ORDER BY `created_at` DESC
 LIMIT 10
---
    public function index()
{
    if (!session()->get('logged_in')) {
        return redirect()->to('/login')->with('error', 'Authentication Required');
    }

    $userId = session()->get('user_id');
    $accessLevel = session()->get('access_lvl');

    // Check user access level
    if ($accessLevel == 1) {
        // Access level 1: Show all QR codes
        $data['qrCodes'] = $this->qrCodeModel->orderBy('created_at', 'DESC')->findAll(10);
    } else {
        // Access level 2: Show only QR codes belonging to the user
        $data['qrCodes'] = $this->qrCodeModel->where('user_id', $userId)
                                               ->orderBy('created_at', 'DESC')
                                               ->findAll(10);

SELECT *
FROM `version`
WHERE `version`.`id` = 1
SELECT COUNT(*) AS `numrows`
FROM `detailed_qr_codes`
WHERE `user_id` = '8'
---
    public function generate_qr_code()
{
    if (!session()->get('logged_in')) {
        return redirect()->to('/login')->with('error', 'Authentication Required');
    }

     // Check version level
     $versionModel = new VersionModel();
     $currentVersion = $versionModel->find(1);
     $userId = session()->get('user_id');

     // Get the count of QR codes generated by the user
     $qrCodeCount = $this->qrCodeModel->where('user_id', $userId)->countAllResults();