app/Controllers/Home.php

SELECT *
FROM `version`
 LIMIT 1
---
    public function index()
    {
        if (!session()->get('logged_in')) {
            session()->setFlashdata('error', 'Authentication required.');
            return redirect()->to('/login');
        }


        // Load the VersionModel
        $versionModel = new \App\Models\VersionModel();

        // Retrieve the version data
        $versionData = $versionModel->first();