app/Controllers/QrCodeController.php

    public function generate_qr_code()
    {
        if (!session()->get('logged_in')) {
            return redirect()->to('/login')->with('error', 'Authentication Required');
        }

        $data['title'] = 'Generate QR Code from a Link'; // Set the title

        // Check version level
        $versionModel = new VersionModel();
        $currentVersion = $versionModel->find(1);
        $userId = session()->get('user_id');

        // Get the count of QR codes generated by the user
        $qrCodeCount = $this->qrCodeModel->where('user_id', $userId)->countAllResults();
---
SELECT *
FROM `version`
WHERE `version`.`id` = 1
SELECT COUNT(*) AS `numrows`
FROM `qr_codes`
WHERE `user_id` = '8'

    public function edit_qr_code($id)
{
    if (!session()->get('logged_in')) {
        return redirect()->to('/login')->with('error', 'Authentication Required');
    }

    $data['title'] = 'Edit QR Code'; // Set the title

    // Find the existing QR code by ID
    $qrCode = $this->qrCodeModel->find($id);
    if (!$qrCode || $qrCode['user_id'] != session()->get('user_id')) {
        throw new \CodeIgniter\Exceptions\PageNotFoundException('QR Code not found or you do not have permission to edit it.');
    }

    // Check if the request method is POST
    if ($this->request->getMethod() === 'POST') {
        $link = $this->request->getPost('link');

        // Delete the old QR code image if necessary
        $oldQrCodeImage = $qrCode['qr_code_image'];
        if ($oldQrCodeImage && file_exists($oldQrCodeImage)) {
            unlink($oldQrCodeImage); // Remove the old QR code image from the server
        }

        // Generate a new QR Code
        $qrCodeImage = $this->generateQrCode($link); // Adjust this method call as necessary

        // Update the QR Code details
        $this->qrCodeModel->update($id, [
            'link' => $link,
            'qr_code_image' => $qrCodeImage
        ]);
---
SELECT *
FROM `qr_codes`
WHERE `qr_codes`.`id` = '14'
UPDATE `qr_codes` SET `link` = 'https://bomasofkenya.go.ke/home', `qr_code_image` = 'uploads/qr_codes/66fbece7a1822.png', `updated_at` = '2024-10-01 12:36:55'
WHERE `qr_codes`.`id` IN ('14')

    public function index()
{
    if (!session()->get('logged_in')) {
        return redirect()->to('/login')->with('error', 'Authentication Required');
    }

    $data['title'] = 'Generated QR Codes';
    $userId = session()->get('user_id'); // Get the logged-in user's ID
    $accessLevel = session()->get('access_lvl'); // Get the user's access level

    // Check user access level
    if ($accessLevel == 1) {
        // Access level 1: Show all QR codes
        $data['qrCodes'] = $this->qrCodeModel->orderBy('created_at', 'DESC')->findAll(10);
    } else {
        // Access level 2: Show only QR codes belonging to the user
        $data['qrCodes'] = $this->qrCodeModel->where('user_id', $userId)
                                               ->orderBy('created_at', 'DESC')
                                               ->findAll(10);
    }

    // Get the count of QR codes generated by the user
    $data['qrCodeCount'] = $this->qrCodeModel->where('user_id', $userId)->countAllResults();
---
SELECT *
FROM `qr_codes`
WHERE `user_id` = '8'
ORDER BY `created_at` DESC
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `qr_codes`
WHERE `user_id` = '8'